In [5]:
import pandas as pd

In [16]:
dir_file=!ls
files=list(filter(lambda x: x[-3:]=='csv',dir_file))

In [22]:
df=pd.read_csv('apr.csv')
for f in files:
    if f=='apr.csv':
        continue
    df_2=pd.read_csv(f)
    df=pd.concat([df,df_2])

In [23]:
df.columns=['_','time','area']
df=df[['time','area']]

In [25]:
df.to_csv('processed_file.csv')

In [26]:
df

                       time       area
0          4/1/2014 0:11:00  Manhattan
1          4/1/2014 0:17:00        NaN
2          4/1/2014 0:21:00  Manhattan
3          4/1/2014 0:28:00  Manhattan
4          4/1/2014 0:33:00  Manhattan
...                     ...        ...
1028131  9/30/2014 22:57:00  Manhattan
1028132  9/30/2014 22:57:00        NaN
1028133  9/30/2014 22:58:00  Manhattan
1028134  9/30/2014 22:58:00  Manhattan
1028135  9/30/2014 22:58:00   Brooklyn

[4534327 rows x 2 columns]